src/Documents/Разукомплектовка/Разукомплектовка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Разукомплектовка</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеисправности</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ПаспортЛинейки/ПаспортЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортЛинейки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяТактаМаксимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаМинимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаРасчётное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыпускЗаДеньРасчётный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ТехническийЛидер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СписаниеМПЗПрочее/СписаниеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеНаЛинейку</types>
      <types>DocumentRef.Разукомплектовка</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Разукомплектовка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьОсновнуюЕИ(МПЗ)
Возврат(МПЗ.ОсновнаяЕдиницаИзмерения);	
КонецФункции	

&НаКлиенте
Процедура Разукомплектовать(Команда)
Объект.ТабличнаяЧасть.Очистить();
Результат = ОткрытьФормуМодально("Документ.Разукомплектовка.Форма.ФормаРазукомплектовка",Новый Структура("Изделие,Количество,ПроизводственноеЗадание",Объект.Изделие,Объект.Количество,Объект.ДокументОснование));
	Если Результат <> Неопределено Тогда
		Для каждого МПЗ Из Результат.СписокСписания Цикл
		ТЧ = Объект.ТабличнаяЧасть.Добавить();
		ТЧ.МПЗ = МПЗ.Значение;
		ТЧ.Количество = Число(МПЗ.Представление);
		ТЧ.ЕдиницаИзмерения = ПолучитьОсновнуюЕИ(МПЗ.Значение);
		КонецЦикла;
	ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Отказ = Не ЭтаФорма.ПроверитьЗаполнение();
	Если НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДата()) Тогда
		Если Не Объект.Проведен Тогда
			Если Вопрос("Для последующего проведения документа требуется текущая дата!
				        |Установить текущую дату?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Объект.Дата = ТекущаяДата();
			Иначе		
			Отказ = Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
	Объект.Автор = ПараметрыСеанса.Пользователь;	
	КонецЕсли;
		Если Объект.РабочееМесто.ЗаканчиватьПредыдущийЭтап Тогда
		Отказ = Истина;
		Сообщить("Выбранное рабочее место предполагает завершение задания на предыдущем рабочем месте! 
				 |Выберите предыдущее рабочее место для правильной работы программы!");
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПечатьАктаОСписанииПоСтатьеЗатратНаСервере(ТабДок)
Макет = Документы.СписаниеМПЗПрочее.ПолучитьМакет("АктОСписанииПоСтатьеЗатрат");
ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ДвижениеМПЗ") Тогда	
		Если ТипЗнч(Объект.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ПроизводственноеЗадание") Тогда
		Линейка = СокрЛП(Объект.ДокументОснование.ДокументОснование.Линейка);
		ПаспортЛинейки = РегистрыСведений.ПаспортЛинейки.ПолучитьПоследнее(Объект.Дата,Новый Структура("Линейка",Линейка));
		Мастер = ПаспортЛинейки.Мастер;
		Иначе
		Линейка = "";
		Мастер = "";
		КонецЕсли;		
	КонецЕсли; 
ОблШапка.Параметры.НазваниеОрганизации = Константы.НазваниеОрганизации.Получить();
ОблШапка.Параметры.ИННАдрес = СокрЛП(Константы.ИННОрганизации.Получить())+", "+СокрЛП(Константы.АдресОрганизации.Получить());
ОблШапка.Параметры.ЗаместительДиректораПоПроизводству = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Заместитель директора по производству");
ОблШапка.Параметры.РуководительПодразделения = СокрЛП(Объект.Подразделение.Руководитель.Наименование);
ОблШапка.Параметры.ДолжностьРуководителяПодразделения = СокрЛП(Объект.Подразделение.Руководитель.Должность.Наименование); 
ОблШапка.Параметры.Мастер = Мастер;
ОблШапка.Параметры.НачальникСТК = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Начальник СТК");
ОблШапка.Параметры.Номер = Объект.Номер;
ТабДок.Вывести(ОблШапка);
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ОблСтрока.Параметры.Код = ?(ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Материалы"),ТЧ.МПЗ.Код,"");
	ОблСтрока.Параметры.Наименование = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблСтрока.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ОблСтрока.Параметры.Количество = ТЧ.Количество;
	ОблСтрока.Параметры.Сумма = ОбщийМодульВызовСервера.ПолучитьСтоимостьМПЗ(ТЧ.МПЗ,1,Объект.Дата,0)*ТЧ.ЕдиницаИзмерения.Коэффициент*ТЧ.Количество;	
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
ОблПодвал.Параметры.СтатьяСписания = СокрЛП(Объект.Статья.Наименование);
ОблПодвал.Параметры.АвторДокумента = СокрЛП(Объект.Автор.Наименование); 
ОблПодвал.Параметры.РуководительПодразделения = СокрЛП(Объект.Подразделение.Руководитель.Наименование);
ОблПодвал.Параметры.ДолжностьРуководителяПодразделения = СокрЛП(Объект.Подразделение.Руководитель.Должность.Наименование); 
ОблПодвал.Параметры.Мастер = Мастер;
ОблПодвал.Параметры.НачальникСТК = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Начальник СТК");
ТабДок.Вывести(ОблПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктаОСписанииПоСтатьеЗатрат(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
	Сообщить("Для печати документ необходимо перепровести.");
	Возврат;		
	КонецЕсли;
ТабДок = Новый ТабличныйДокумент;

ПечатьАктаОСписанииПоСтатьеЗатратНаСервере(ТабДок);
ТабДок.Показать("Печать акта о списании по статье затрат");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
КонецПроцедуры
